[{"name":"Got to Be There","cover_url":"http://cps-static.rovicorp.com/3/JPG_400/MI0001/495/MI0001495647.jpg?partner=allrovi.com","review":"Riding high on the wild success of the Jackson 5, Motown ringleader Berry Gordy assembled every single notable production team member and songwriter in his arsenal to contribute to the solo debut of the J5's boy wonder, Michael. By the time Got to Be There was released, much had changed in the Jackson dynamic, none the least Michael's voice. But this album launched three chart singles: a cover of the bubblegum classic \"Rockin' Robin,\" Leon Ware's \"I Wanna Be Where You Are,\" and the title track. As a cohesive album, Got to Be There is wildly erratic, and his covers of \"You've Got a Friend\" and \"Ain't No Sunshine\" show Jackson's versatility as a singer. It was a world away from the politically charged sound of Marvin Gaye's What's Going On and the introspection that would later grace some of the best works of Stevie Wonder. But Got to Be There kept Gordy as king of the sound of young America -- at least for a few months longer."},{"name":"Ben","cover_url":"http://cps-static.rovicorp.com/3/JPG_400/MI0002/355/MI0002355600.jpg?partner=allrovi.com","review":"Although having just entered his teens, pop prodigy Michael Jackson's star was still very much on the ascent, circa his second full-length release, Ben (1972). This LP should not be confused with the Original Motion Picture Soundtrack from the Phil Karlson-directed \"thriller\" of the same name, and while blessed with an undeniable visual presence, Jackson was otherwise not involved in the creature feature. Like much of the Motown empire at the time, the title track's multimedia exposure, coupled with strong crossover appeal, insured that \"Ben\" scored the artist his first Pop Singles' chart-topper. Yet one interesting shift was the lack of participation from the Motown hitmaking machine known collectively as \"the Corporation\". While the aggregate had dominated most of the Jackson Five's early recordings and contributed their fair share to Jackson's debut, Got to Be There (1971), besides the title track, the only other cut to bear their unmistakable smooth production style is the practically perfunctory midtempo \"We've Got a Good Thing Going.\" The catchy \"Greatest Show on Earth\" has a cinematic quality that stands out thanks to an excellent arrangement from James Anthony Carmichael -- one of several he scored for the project. While not a cover in the traditional sense, \"People Make the World Go 'Round\" was actually released within a few weeks of the Stylistics' more familiar hit. Although the reading heard here is equally impassioned, the emotive impact could arguably be greater thanks to the optimism infused with innocence in Jackson's vocals. \"Everybody's Somebody's Fool\" owes greatly to the Heartbeats' doo wop version, as opposed to Jimmy Scott's earlier classic. Jackson is obviously quite familiar with the former's phrasing while adding an age-defying maturity of his own. Returning back to his Hitsville roots, \"My Girl\" is updated with a funkier rhythm. The vocalist responds in kind with his own soulful lead that soars over the freshly syncopated chorus. The score includes some call-and-response interaction similar to what he and his brothers had displayed on the Jackson Five's selections \"Nobody\" and \"The Love You Save,\" among countless others. \"What Goes Around Comes Around\" is one of Ben's better deep cuts with the vibrant melody perfectly matched to the artist's youthful voice. Of lesser note is the hopelessly dated \"message\" in the filler track \"In Our Small Way.\" Luckily, a pair of winners conclude the effort with the propulsive and funky \"Shoo Be Doo Be Doo Da Day\" -- which was co-written by Stevie Wonder -- and the Berry Gordy-penned midtempo \"You Can Cry on My Shoulder.\" Ben -- along with rest of Michael Jackson's recordings for Motown, can be found as part of the excellent and thoroughly annotative three-disc Hello World: The Motown Solo Collection (2009)."},{"name":"Music & Me","cover_url":"http://cps-static.rovicorp.com/3/JPG_400/MI0002/151/MI0002151385.jpg?partner=allrovi.com","review":"This was Michael Jackson's least successful album during his solo run at Motown. The songs were undistinguished, Jackson sounded tentative and uninterested vocally, and the production and arrangements were routine at best, sometimes inferior. There's little wonder that Jackson at this point began to openly express his desires to expand his horizons and try a fresher, more contemporary approach."},{"name":"Forever, Michael","cover_url":"http://cps-static.rovicorp.com/3/JPG_400/MI0000/914/MI0000914878.jpg?partner=allrovi.com","review":"Michael Jackson's fourth and final new studio album for Motown came nearly two years after its predecessor, Music and Me. It was a more mature effort for the 16-year-old singer but lacked the contemporary dance style that had given Jackson and his brothers a career rebirth with \"Dancing Machine\" the year before. The album did spawn two minor chart singles, \"We're Almost There\" and \"Just a Little Bit of You\" (both produced by Brian Holland of the Holland-Dozier-Holland production team), and a third track, \"One Day in Your Life,\" would chart as a reissue six years later. But though Jackson sang appealingly, the arrangements were noticeably similar to many older Motown charts, and there was little here to hint that, four years hence, on his next solo album, Off the Wall, Jackson would emerge as a major star."},{"name":"Off the Wall","cover_url":"http://cps-static.rovicorp.com/3/JPG_400/MI0000/677/MI0000677646.jpg?partner=allrovi.com","review":"Michael Jackson had recorded solo prior to the release of Off the Wall in 1979, but this was his breakthrough, the album that established him as an artist of astonishing talent and a bright star in his own right. This was a visionary album, a record that found a way to break disco wide open into a new world where the beat was undeniable, but not the primary focus -- it was part of a colorful tapestry of lush ballads and strings, smooth soul and pop, soft rock, and alluring funk. Its roots hearken back to the Jacksons' huge mid-'70s hit \"Dancing Machine,\" but this is an enormously fresh record, one that remains vibrant and giddily exciting years after its release. This is certainly due to Jackson's emergence as a blindingly gifted vocalist, equally skilled with overwrought ballads as \"She's Out of My Life\" as driving dancefloor shakers as \"Working Day and Night\" and \"Get on the Floor,\" where his asides are as gripping as his delivery on the verses. It's also due to the brilliant songwriting, an intoxicating blend of strong melodies, rhythmic hooks, and indelible construction. Most of all, its success is due to the sound constructed by Jackson and producer Quincy Jones, a dazzling array of disco beats, funk guitars, clean mainstream pop, and unashamed (and therefore affecting) schmaltz that is utterly thrilling in its utter joy. This is highly professional, highly crafted music, and its details are evident, but the overall effect is nothing but pure pleasure. Jackson and Jones expanded this approach on the blockbuster Thriller, often with equally stunning results, but they never bettered it."},{"name":"Thriller","cover_url":"http://cps-static.rovicorp.com/3/JPG_400/MI0000/677/MI0000677650.jpg?partner=allrovi.com","review":"Off the Wall was a massive success, spawning four Top Ten hits (two of them number ones), but nothing could have prepared Michael Jackson for Thriller. Nobody could have prepared anybody for the success of Thriller, since the magnitude of its success was simply unimaginable -- an album that sold 40 million copies in its initial chart run, with seven of its nine tracks reaching the Top Ten (for the record, the terrific \"Baby Be Mine\" and the pretty good ballad \"The Lady in My Life\" are not like the others). This was a record that had something for everybody, building on the basic blueprint of Off the Wall by adding harder funk, hard rock, softer ballads, and smoother soul -- expanding the approach to have something for every audience. That alone would have given the album a good shot at a huge audience, but it also arrived precisely when MTV was reaching its ascendancy, and Jackson helped the network by being not just its first superstar, but first black star as much as the network helped him. This all would have made it a success (and its success, in turn, served as a new standard for success), but it stayed on the charts, turning out singles, for nearly two years because it was really, really good. True, it wasn't as tight as Off the Wall -- and the ridiculous, late-night house-of-horrors title track is the prime culprit, arriving in the middle of the record and sucking out its momentum -- but those one or two cuts don't detract from a phenomenal set of music. It's calculated, to be sure, but the chutzpah of those calculations (before this, nobody would even have thought to bring in metal virtuoso Eddie Van Halen to play on a disco cut) is outdone by their success. This is where a song as gentle and lovely as \"Human Nature\" coexists comfortably with the tough, scared \"Beat It,\" the sweet schmaltz of the Paul McCartney duet \"The Girl Is Mine,\" and the frizzy funk of \"P.Y.T. (Pretty Young Thing).\" And, although this is an undeniably fun record, the paranoia is already creeping in, manifesting itself in the record's two best songs: \"Billie Jean,\" where a woman claims Michael is the father of her child, and the delirious \"Wanna Be Startin' Something,\" the freshest funk on the album, but the most claustrophobic, scariest track Jackson ever recorded. These give the record its anchor and are part of the reason why the record is more than just a phenomenon. The other reason, of course, is that much of this is just simply great music."},{"name":"Bad","cover_url":"http://cps-static.rovicorp.com/3/JPG_400/MI0000/677/MI0000677652.jpg?partner=allrovi.com","review":"The downside to a success like Thriller is that it's nearly impossible to follow, but Michael Jackson approached Bad much the same way he approached Thriller -- take the basic formula of the predecessor, expand it slightly, and move it outward. This meant that he moved deeper into hard rock, deeper into schmaltzy adult contemporary, deeper into hard dance -- essentially taking each portion of Thriller to an extreme, while increasing the quotient of immaculate studiocraft. He wound up with a sleeker, slicker Thriller, which isn't a bad thing, but it's not a rousing success, either. For one thing, the material just isn't as good. Look at the singles: only three can stand alongside album tracks from its predecessor (\"Bad,\" \"The Way You Make Me Feel,\" \"I Just Can't Stop Loving You\"), another is simply OK (\"Smooth Criminal\"), with the other two showcasing Jackson at his worst (the saccharine \"Man in the Mirror,\" the misogynistic \"Dirty Diana\"). Then, there are the album tracks themselves, something that virtually didn't exist on Thriller but bog down Bad not just because they're bad, but because they reveal that Jackson's state of the art is not hip. And they constitute a near-fatal dead spot on the record -- songs three through six, from \"Speed Demon\" to \"Another Part of Me,\" a sequence that's utterly faceless, lacking memorable hooks and melodies, even when Stevie Wonder steps in for \"Just Good Friends,\" relying on nothing but studiocraft. Part of the joy of Off the Wall and Thriller was that craft was enhanced with tremendous songs, performances, and fresh, vivacious beats. For this dreadful stretch, everything is mechanical, and while the album rebounds with songs that prove mechanical can be tolerable if delivered with hooks and panache, it still makes Bad feel like an artifact of its time instead a piece of music that transcends it. And if that wasn't evident proof that Jackson was losing touch, consider this -- the best song on the album is \"Leave Me Alone\" (why are all of his best songs paranoid anthems?), a tune tacked on to the end of the CD and never released as a single, apart from a weirdly claustrophobic video that, not coincidentally, was the best video from the album."},{"name":"Dangerous","cover_url":"http://cps-static.rovicorp.com/3/JPG_400/MI0002/297/MI0002297222.jpg?partner=allrovi.com","review":"Despite the success of Bad, it was hard not to view it as a bit of a letdown, since it presented a cleaner, colder, calculated version of Thriller -- something that delivered what it should on the surface, but wound up offering less in the long run. So, it was time for a change-up, something even a superstar as huge as Michael Jackson realized, so he left Quincy Jones behind, hired Guy mastermind Teddy Riley as the main producer, and worked with a variety of other producers, arrangers, and writers, most notably Bruce Swedien and Bill Bottrell. The end result of this is a much sharper, harder, riskier album than Bad, one that has its eyes on the street, even if its heart gets middle-class soft on \"Heal the World.\" The shift in direction and change of collaborators has liberated Jackson, and he's written a set of songs that is considerably stronger than Bad, often approaching the consistency of Off the Wall and Thriller. If it is hardly as effervescent or joyous as either of those records, chalk it up to his suffocating stardom, which results in a set of songs without much real emotional center, either in their substance or performance. But, there's a lot to be said for professional craftsmanship at its peak, and Dangerous has plenty of that, not just on such fine singles as \"In the Closet,\" \"Remember the Time,\" or the blistering \"Jam,\" but on album tracks like \"Why You Wanna Trip on Me.\" No, it's not perfect -- it has a terrible cover, a couple of slow spots, and suffers from CD-era ailments of the early '90s, such as its overly long running time and its deadening Q Sound production, which sounds like somebody forgot to take the Surround Sound button off. Even so, Dangerous captures Jackson at a near-peak, delivering an album that would have ruled the pop charts surely and smoothly if it had arrived just a year earlier. But it didn't -- it arrived along with grunge, which changed the rules of the game nearly as much as Thriller itself. Consequently, it's the rare multi-platinum, number one album that qualifies as a nearly forgotten, underappreciated record."},{"name":"Blood on the Dance Floor: HIStory in the Mix","cover_url":"http://cps-static.rovicorp.com/3/JPG_400/MI0002/088/MI0002088512.jpg?partner=allrovi.com","review":"Despite its heavy promotion, HIStory was a considerable sales disappointment, largely because it buried an album of new material with a greatest-hits collection, causing the former to be overlooked. Although the new album was unfocused, it had its moments, which may be why Michael Jackson refused to let HIStory die. He remixed eight of its songs for Blood on the Dance Floor: History in the Mix, and then saddled that record with five new songs, which means that he repeated the same mistake by burying the new songs yet again. This time, however, it wasn't such a loss, since all the songs on Blood on the Dance Floor are embarrassingly weak, sounding tired, predictable and, well, bloodless. The title track, a bleak reworking of \"Jam\" and \"Scream,\" is indicative of the weakness of the album, but it only touches on how sad the whole affair is. It would be one thing if Jackson wasn't relevant to the late '90s and ignored all contemporary innovations, since he could then make good music on his own terms. However, he flaunts his ignorance aggressively, as if sheer willpower will return him to the charts, making it all the more apparent that he can no longer craft a good melody or beat. And for one of the greatest musicians of the late '70s and early '80s, that's quite a depressing state of affairs."},{"name":"Invincible","cover_url":"http://cps-static.rovicorp.com/3/JPG_400/MI0001/644/MI0001644295.jpg?partner=allrovi.com","review":"Let's get the clichéd bad joke out of the way to begin with: at the time Michael Jackson released Invincible in the fall of 2001, he hardly seemed \"invincible\" -- it was more wishful thinking than anything else, since he hadn't really had a genuine hit in ten years, and even that paled in comparison to his total domination of the '80s. That lack of commercial success, combined with a fading reputation as a trailblazer, a truly ugly public scandal, and swirling rumors about his diminishing finances, along with a huge wait between albums (by teaming his Dangerous follow-up with a hits collection, it wound up being overlooked, despite a gaudy publicity push), resulted in Jackson being deep down in the hole, needing to surge back out with a record that not only proved his talents, but his staying power. So, faced with a make-or-break record, what did Jackson do to save his career? What he did since Dangerous, take a turn toward the street and craft a hard-driving, hard-polished urban soul album, heavy on the dance numbers and sweetened by lugubrious ballads. It's a proven formula for commercial success, but it not only didn't push his music forward, it made his reach seem rather timid when compared to the wildly rich, all-encompassing musical vision of Thriller and Bad. Here, he's reined in by a desire to prove himself, so he keeps his focus sharp and narrow, essentially creating a sparkly, post-hip-hop update of Off the Wall. It's not as good as that sounds, because the infectious joy and layered craft of that masterpiece have been replaced with a dogged, near-maniacal desire to craft something hip enough for the clubs and melodic enough for mainstream radio, thereby confirming his self-proclaimed status as the King of Pop (a really terrible title, btw). Since he was exceptionally talented and smart enough to surround himself with first-rate collaborators, this does pay off on occasion, even when it feels a little too calculated or when it feels a little padded. Ultimately, the record runs too long, losing steam halfway through, as it turns to a series of rants about \"Privacy\" or a deadly stretch of uncomfortably treacly, sub-\"Man in the Mirror\" songs about \"The Lost Children,\" or when he says that he can't change the world by himself on \"Cry.\" Fortunately, Jackson was clever enough to front-load this record, loading the first seven songs with really good, edgy dance numbers -- even the opening \"Unbreakable\" isn't sunk by the creepy resurrection of Biggie Smalls -- and lovely ballads, highlighted by \"Break of Dawn\" and \"Butterflies\" with its Bacharach-styled horns. Even if these are too self-conscious and a little mechanical (which they are), they still have a spark and sound better than anything Jackson had done since Dangerous. That's not enough to make Invincible the comeback Jackson needed -- he really would have had to have an album that sounded free instead of constrained for that to work -- but it does offer a reminder that he could really craft good pop. If only he had been fueled, not constrained, by his obsessions, this could have been really interesting."},{"name":"Michael Jackson's This Is It","cover_url":"http://cps-static.rovicorp.com/3/JPG_400/MI0002/876/MI0002876944.jpg?partner=allrovi.com","review":"An important thing to remember when considering the soundtrack to This Is It: this entire film and CD project was never supposed to happen. This Is It was designed as a comeback tour, not a movie, with the rehearsals taped not for exhibition, but rather instruction, possibly some video bonus down the line. Of course, Michael Jackson's tragic passing created considerable demand for those final rehearsals (no need to get into the financial need, as well), so they were packaged as the This Is It film, released almost five months after his death, with a soundtrack as an accompaniment. Since there were no real live recordings made, at least not any to fill a big-budget blockbuster like this, the soundtrack consists of almost nothing but the hits repackaged one more time, with the title track -- an '80s leftover, co-written by Paul Anka and released under the name \"I Never Heard\" by Safire -- added as an enticement in two separate versions, the second being orchestral with an opening straight out of Sgt. Pepper's. The song does feel like a demo, right down to how it fades out mid-chorus, but there's no denying the thrill of hearing an unheard vocal track of Michael at his prime, no matter how mediocre the song may be. Whether this makes this worth purchasing is another question entirely. There's a second disc containing demos of \"She's Out of My Life\" (just Michael and an acoustic, quite nice) \"Wanna Be Startin' Somethin'\" (full demo, with identical rhythm and guitar lines, close to the final version but lacking its horns), and \"Beat It\" (a true writer's sketch, all vocals and harmonies, no lyrics or instruments, kind of awesome) plus a \"poem\" of \"Planet Earth.\""},{"name":"Michael","cover_url":"http://cps-static.rovicorp.com/3/JPG_400/MI0003/056/MI0003056524.jpg?partner=allrovi.com","review":"As the first excavation of Michael Jackson’s vaults, Michael carries the weight of expectation it cannot possibly bear to support. After Jackson split with Quincy Jones following 1987’s Bad, he had a revolving door on his studio, letting in all major producers for a track or three, sometimes selecting these songs for a finished album, sometimes not. Michael rounds up ten of these leftovers, relying heavily on cuts he was tinkering with in the years after Invincible, but apart from cameos by Akon and 50 Cent, there’s precious little here that sounds modern. Perhaps it’s the heavy presence of Teddy Riley, but much of this recalls the cacophonic clutter of Dangerous, heavy on rhythms but not melody, so desperate for relevance that every overdub is overworked. Tellingly, the exceptions to the rule are the oldest tunes here -- “Behind the Mask” and “Much Too Soon,” both dating back to Thriller, and “(I Like) The Way You Love Me,” an outtake first aired on the 2004 box The Ultimate Collection and reworked somewhat extensively here. Much of this has likely been tweaked extensively to prep it for release, but it’s impossible to discern exactly what overdubs were added after Jackson’s death, particularly because this so heavily recalls his last decade of released records, right down to the recurring theme of MJ’s persecution, which sounds quite bizarre in the wake of his passing. That and Akon’s self-aggrandizing salvo to the opening “Hold My Hand” are the only ghoulish touches here: Michael is often tacky but considering how garish Jackson’s taste could be, it winds up seeming almost respectful. At the very least, the album doesn’t tarnish his legacy, although it adds nothing to it either."}]